window.form.questions_proto = [
  {
    id: 1,
    text: "Год рождения.",
    extra_input: ""
  },
  {
    id: 2,
    text: "Город, в котором вы живёте.",
    extra_input: ""
  },
  {
    id: 3,
    text: "Вуз, факультет, специальность, кафедра.",
    extra_input: ""
  },
  {
    id: 4,
    text: "Год окончания вуза.",
    extra_input: ""
  },
  {
    id: 5,
    text: "Уровень владения английским языком:",
    extra_input: '<div class=""><p><input type="checkbox" name="q5" value="1" id="a5_1"><label for="a5_1">&nbsp;начальный;</label></p><p><input type="checkbox" name="q5" value="2" id="a5_2"><label for="a5_2">&nbsp;средний;</label></p><p><input type="checkbox" name="q5" value="3" id="a5_3"><label for="a5_3">&nbsp;свободное владение.</label></p></div>'
  },
  {
    id: 6,
    text: "Чего вы ожидаете от участия в Школе?",
    extra_input: ""
  },
  {
    id: 7,
    text: "Откуда вы о нас узнали?",
    extra_input: ""
  },
  {
    id: 8,
    text: "Сколько времени вы были бы готовы уделять стажировке или работе в Яндексе?",
    extra_input: ""
  },
  {
    id: 9,
    text: "Расскажите о вашем опыте разработки. Нам будет интересно всё — как серьезный интерфейс, так и просто домашняя страничка.",
    extra_input: ""
  },
  {
    id: 10,
    text: "Если вы где-нибудь работали, расскажите, какие у вас были должностные обязанности и был ли опыт работы в команде.",
    extra_input: ""
  },
  {
    id: 11,
    text: "Перечислите, какими программными продуктами вы пользуетесь в своей работе — от редактора до специализированных утилит (Intellij Idea, Node.js, Uglify.js, GNU Make). Для каждого инструмента укажите, какие задачи вы с помощью него решаете и почему выбрали именно его.",
    extra_input: ""
  },
  {
    id: 12,
    text: "Пользуетесь ли вы командной строкой? Какими командами вы пользуетесь и какие задачи вы решаете с их помощью? С какими программами вы преимущественно или полностью взаимодействуете через интерфейс командной строки?",
    extra_input: ""
  },
  {
    id: 13,
    text: "Напишите на JavaScript функцию, которая выводит список всех чисел, которые равны сумме факториалов своих цифр. <br><br> Пример такого числа: 4! + 0! + 5! + 8! + 5! = 40585 <br><br> В качестве ответа на вопрос пришлите ссылку на http://jsfiddle.net/ с вашим кодом или на ваш репозиторий на https://github.com/.",
    extra_input: ""
  },
  {
    id: 14,
    text: "Вы — пилот грузового межгалактического корабля. Ваша работа — перевозка грузов с одной планету на другую. Грузоподъемность вашего корабля ограничена, поэтому за один рейс вы можете перевезти не более N кг полезного груза. Ваш корабль умеет сообщать свое состояние (местоположение и степень загруженности), а также летать в любую точку пространства. Каждая планета может содержать на себе груз, который можно взять. Также на каждой планете груз можно оставить . <br><br> Задание <br><br> Даны незавершенные интерфейсы корабля и планеты. Напишите недостающий код. <br><br> Полное условие задачи доступно на <br><br> https://github.com/yandex-shri/introtask-space. <br><br> В качестве ответа на вопрос пришлите ссылку на http://jsfiddle.net/ с вашим кодом или на ваш репозиторий на https://github.com/.",
    extra_input: ""
  },
  {
    id: 15,
    text: "Сверстайте форму-анкету с нашими заданиями для кандидатов. Страница должна работать в следующих браузерах: MSIE (8, 9, 10), Google Chrome (26, 27), Firefox (20, 21), Opera (12.15, 12.14), Яндекс.Браузер 1.5. По возможности используйте приёмы безопасной деградации CSS. Страница должна содержать интерактив, реализованный с помощью JS и jQuery. Это может быть: <br><br> <ul><li>проверка полноты и правильности заполнения полей (где это возможно);</li>  <li>возможность свернуть и развернуть разделы (аккордеон);</li> <li>индикатор заполнения анкеты;</li> <li>что-нибудь ещё.</li></ul> <br><br> Подумайте над тем, как эти данные будут отправляться на сервер. <br><br> Будет плюсом, если вы сверстаете страницу, используя БЭМ. <br><br> Дополнительные задания <br><br> 1. Выполните задание про форму-анкету, используя один из классических шаблонизаторов: Handlebars, mustache, Dust, Jade и т.п. <br><br> 2. Выполните задание про форму-анкету, используя один из экзотических шаблонизаторов: XSLT, YATE, BEMHTML и т.п. <br><br> Разработку необходимо вести на https://github.com/. В качестве ответа на вопрос пришлите ссылку на проект.",
    extra_input: ""
  }
]